Revit 2026 API

# ApplicationNewPointOnEdgeEdgeIntersection Method

---

Construct a PointOnEdgeEdgeIntersection object which is used to define the placement of a ReferencePoint given two references to edge.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PointOnEdgeEdgeIntersection NewPointOnEdgeEdgeIntersection(
	Reference edgeReference1,
	Reference edgeReference2
)
```
```vb
Public Function NewPointOnEdgeEdgeIntersection (
	edgeReference1 As Reference,
	edgeReference2 As Reference
) As PointOnEdgeEdgeIntersection
```
```cpp
public:
PointOnEdgeEdgeIntersection^ NewPointOnEdgeEdgeIntersection(
	Reference^ edgeReference1,
	Reference^ edgeReference2
)
```
```fsharp
member NewPointOnEdgeEdgeIntersection :
        edgeReference1 : Reference *
        edgeReference2 : Reference -> PointOnEdgeEdgeIntersection
```

#### Parameters

edgeReference1 Reference
    The first edge reference.
edgeReference2 Reference
    The second edge reference.

#### Return Value

PointOnEdgeEdgeIntersectionA new PointOnEdgeEdgeIntersection object.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input argument edgeReference1 or edgeReference2 is . |

#### Reference

Application Class

Autodesk.Revit.Creation Namespace